export const mockResumeData = {
  id: "6835277c08e79f69d2a23575",
  url: "https://www.wanted.co.kr/wd/283067",
  company: "토스페이먼츠",
  position: "서버 개발자(3년이하)",
  mainTasks: [
    "지속적으로 증가하는 결제 요청량과 다양한 요구사항을 쉽게 구현할 수 있도록 확장성과 유연성이 높은 시스템을 만들어요.",
    "선착순 결제와 같은 이벤트를 진행하여 수십배의 트래픽이 순간적으로 발생해도 무너지지 않는 시스템을 만들어요.",
    "수많은 거래건을, 수백가지 요구사항으로 계산해도 빠르게, 오차없이 계산이 가능한 정산 시스템을 만들어요.",
    "자유로운 무중단 배포가 가능한 MSA 환경에서 사업자의 비즈니스 어려움을 해결할 새로운 API 를 만들어요.",
    "토스페이먼츠와 고객사 시스템의 접점이 되는 OpenAPI 와 OpenAPI 를 지탱하기 위한 생태계를 만들어요."
  ],
  requirements: [
    "개발 실무 경력 3년 이하인 분",
    "해외 여행에 결격사유가 없는 분",
    "현재 토스커뮤니티는 병역특례 대상자를 채용하고 있지 않아요. 전직 및 신규 편입이 모두 불가능하니, 꼭 확인 후 지원해주세요.",
    "최근 6개월 내 토스커뮤니티 지원 이력이 있는 분들은, 업데이트된 이력서를 제출해주시거나 6개월 이후 재지원 해주시길 부탁드려요."
  ],
  career: "3년 이하",
  resumeRequirements: [
    "(해결해 본 문제의 규모와 상관없이) 개발과 관련한 문제 상황을 개선하거나 해결해 보신 사항을 최대한 구체적으로 작성해 주세요.",
    "레거시 코드를 리팩토링 해보신 경험이 있다면 좋아요.",
    "기술자로서 비즈니스의 문제를 해결했던 경험과 그 과정에서 활용하셨던 기술적 장점이 드러나는 사례를 자세히 적어주시면 좋아요."
  ],
  recruitmentProcess: [
    "서류접수",
    "사전과제",
    "직무 인터뷰",
    "문화적합성 인터뷰",
    "레퍼런스 체크",
    "처우협의",
    "최종 합격 및 입사"
  ],
  spaceId: 59,
  createdAt: "2025-05-27T11:46:20.98",
  updatedAt: "2025-05-27T11:46:20.98",
  publicGrade: "PUBLIC"
};
  